#include <stdio.h>

int main() {
    float score = 95.5f;
    printf("score: %.1f\n", score); 
    return 0;
}

// กรณีที่ 1 ใช้ int จะสามารถเก็บได้เพียงค่าจำนวนเต็มเท่านั้น ทศนิยมที่มีจะถูกตัดออก
// กรณีที่ 2 ใช้ float จะสามารถเก็บค่าทศนิยมได้ แต่ความแม่นยำอาจจะไม่สูงมากนัก

// ทำไมต้องเลือกใช้ Data type ให้เหมาะสม?
   // เพราะการเลือกใช้ Data type ที่เหมาะสมจะช่วยให้โปรแกรมทำงานได้อย่างมีประสิทธิภาพ และสามารถจัดเก็บข้อมูลได้อย่างถูกต้อง
//อภิปราย และสรุปผลจากการทดลอง
  // ในการเก็บข้อมูลในครั้งนี้ควรเลือกใช้เป็น float เพราะต้องการเก็บค่าทศนิยม ซึ่ง float สามารถเก็บค่าทศนิยมได้ดีกว่า int ที่จะตัดทศนิยมออกไป 
  // และการเลือกใช้ Data type ที่ถูกต้องจะช่วยให้ข้อมูลที่ต้องการเก็บมีความสมบูรณ์และถูกต้อง